[
  {
    "id": "Climate Change Awareness",
    "title": "Together for climate change",
    "date": "2025-10-02",
    "summary": "We had the privilege of conducting the inaugural session of our Climate Change Awareness Program under the T4CC(Together for climate change) initiative in collaboration with AMMACTS.",
    "image": "T4CC.jpg",
    "content": "As part of this session, we hosted a creative drawing activity for children, encouraging them to express their vision of a sustainable and greener future. 🎨💡. It was inspiring to see how young minds imagine solutions for the planet — a powerful reminder that the fight against climate change starts with awareness and education at an early age. 🌳🌎",
    "location": "Seetharampet,Yerpedu, Andhra Pradesh",
    "category": "Workshop"
  },
  {
    "id": "Climate Change Awareness-1",
    "title": "Ideas & Innovation: Meeting with an IIT Professor",
    "date": "2025-09-19",
    "summary": "We met with an IIT professor to discuss climate change, its impact, and innovative ways to build a sustainable future.",
    "image": "IITT.jpg",
    "content": "We had the privilege of meeting with a distinguished professor from the Indian Institute of Technology (IIT) to engage in an in-depth discussion on climate change and sustainability. The conversation focused on understanding the current challenges posed by climate change, its impact on communities and ecosystems, and the urgent need for innovative solutions. We explored strategies to reduce carbon emissions, promote renewable energy adoption, and integrate sustainable practices into everyday life. The professor shared valuable insights on how technology, research, and education can play a vital role in addressing climate issues. This interaction not only broadened our perspective but also inspired us to create impactful initiatives that can raise awareness and empower the next generation to take meaningful action for a greener, more resilient planet.",
    "location": "IIT - Tirupati",
    "category": "Meeting"
  },
  {
    "id": "Climate Change Awareness-2",
    "title": "Insightful Interaction with an Senior Scientist",
    "date": "2025-09-17",
    "summary": "We visited Krishi Vigyan Kendra (KVK), Chittoor, and met Dr. S. Sreenivasulu, Senior Scientist and Head, to discuss sustainable farming practices, innovative agricultural technologies, and ways to support farmers in adapting to climate change.",
    "image": "KVK.jpg",
    "content": "During our visit, we engaged in a fruitful discussion on various aspects of sustainable agriculture, including soil health, water conservation, and the use of technology in farming. Dr. Sreenivasulu shared valuable insights on the challenges faced by farmers in the region and the importance of adopting climate-resilient practices. We also explored potential collaborations to promote research and extension services that can benefit local farming communities.",
    "location": "Krishi Vigyan Kendra (KVK) - Chittor",
    "category": "Meeting"
  },
  {
    "id": "Conference",
    "title": "International Conference",
    "date": "2025-03-01",
    "summary": "Our NGO Secretary attended the International Conference at Maastricht University, Netherlands, representing our organization and engaging in global discussions on sustainability and social impact.",
    "image": "Conf.png",
    "content": "Our NGO Secretary had the honor of attending the International Conference at Maastricht University, Netherlands, bringing our organization’s vision and work to an international platform. The conference brought together experts, researchers, and changemakers from around the world to share insights and explore innovative solutions for today’s pressing global challenges. During the event, our Secretary participated in meaningful discussions on sustainability, community development, and climate action, while also networking with international leaders and organizations for potential collaborations. This participation not only highlighted our NGO’s initiatives but also provided valuable knowledge and global perspectives that will help us strengthen our impact and expand our efforts towards a more sustainable and equitable future.",
    "location": "Maastricht University, Netherlands",
    "category": "Conference"
  },
  {
    "id": "women-entrepreneurship-fair",
    "title": "Women Entrepreneurship Fair",
    "date": "2025-04-10",
    "summary": "Showcasing and celebrating women-led enterprises and social businesses from rural communities.",
    "image": "event-women.jpg",
    "content": "A vibrant fair featuring women entrepreneurs showcasing their products from food processing, handicrafts, organic farming, and sustainable enterprises. The event includes business networking sessions, market linkage opportunities, and recognition awards.",
    "location": "Exhibition Ground, Pune",
    "category": "Fair"
  },
  {
    "id": "youth-climate-conclave",
    "title": "Youth Climate Action Conclave",
    "date": "2025-05-18",
    "summary": "Engaging rural youth in climate action through interactive sessions, competitions, and project presentations.",
    "image": "event-youth.jpg",
    "content": "An inspiring conclave bringing together young climate champions from rural areas to share ideas, innovations, and commitments to environmental sustainability. The event features keynote speeches, innovation challenges, and youth-led project exhibitions.",
    "location": "University Campus, Karnataka",
    "category": "Conclave"
  }
]
